#Словарь с азбукой Морзе
Morse = {"А":"*-","Б":"-***","В":"*--","Г":"--*","Д":"-**",
"Е":"*","Ж":"***-","З":"--**","И":"**",
"Й":"*---","К":"-*-","Л":"*-**","М":"--","Н":"-*",
"О":"---","П":"*--*","Р":"*-*","С":"***","Т":"-",
"У":"**-","Ф":"**-*","Х":"****","Ц":"-*-*","Ч":"---*",
"Ш":"----","Щ":"--*-","Ъ":"*--*-*","Ы":"-*--","Ь":"-**-",
"Э":"**-**","Ю":"**--","Я":"*-*-"}

#Функция
def translating(text):
#После каждой итерации в данную функцию будет добавляться символ
  code_morse = ''
  for char in text:
    if char.upper() in Morse:
      code_morse += Morse[char.upper()] + ' '
    else:
      code_morse += char + ' '
  return code_morse

# Ввод текста пользователем
text = input("Введите текст на русском языке: ")

# Перевод текста на азбуку Морзе
code_morse = translating(text)

# Вывод результата
print("Текст в азбуке Морзе:", code_morse)